
#==============================================================================
# ■ Game_Action
#------------------------------------------------------------------------------
# 　戦闘行動を扱うクラスです。
#==============================================================================

class Game_Action
  #--------------------------------------------------------------------------
  # ● [エイリアス]:ターゲットの配列作成
  #--------------------------------------------------------------------------
  alias :lnx11a_make_targets :make_targets
  def make_targets
    if LNX11::TROOP_X_SORT &&
       subject.actor? && item.for_opponent? && item.for_all?
      # 元のメソッドを呼んでソート
      return lnx11a_make_targets.sort {|a,b| a.screen_x <=> b.screen_x}
    else
      return lnx11a_make_targets
    end
  end
end
