#==============================================================================
# ■ RPG::BaseItem
#------------------------------------------------------------------------------
# 　アクター、職業、スキル、アイテム、武器、防具、敵キャラ、およびステートの
# スーパークラス。
#==============================================================================

class RPG::BaseItem
  #--------------------------------------------------------------------------
  # ● [追加]:バトラーグラフィックファイル名を取得
  #--------------------------------------------------------------------------
  def default_battler_graphic
    # キャッシュがある場合、それを返す
    return @default_battler_graphic if @default_battler_graphic
    # メモ取得
    re = LNX11::RE_BATTLER =~ note
    @default_battler_graphic = re ? $1 : ""
  end
  #--------------------------------------------------------------------------
  # ● [追加]:敵キャラの通常攻撃アニメの取得
  #--------------------------------------------------------------------------
  def atk_animation
    # キャッシュがある場合、それを返す
    return @atk_animation if @atk_animation
    # メモ取得
    re = LNX11::RE_ATK_ANIMATION =~ note
    @atk_animation = re ? $1.to_i : 1
  end
end
