
#==============================================================================
# ■ RPG::UsableItem
#------------------------------------------------------------------------------
# 　スキルとアイテムのスーパークラス。
#==============================================================================
class RPG::UsableItem < RPG::BaseItem
  #--------------------------------------------------------------------------
  # ● [エイリアス]:対象の選択操作が必要か否かを取得
  #--------------------------------------------------------------------------
  alias :lnx11a_need_selection? :need_selection?
  def need_selection?
    LNX11::FIX_TARGET_CHECKE && scope > 0 ? true : lnx11a_need_selection?
  end
  #--------------------------------------------------------------------------
  # ● [追加]:使用時アニメの取得
  #--------------------------------------------------------------------------
  def use_animation
    # キャッシュがある場合、それを返す
    return @use_animation if @use_animation
    # メモ取得
    re = LNX11::RE_USE_ANIMATION =~ note
    @use_animation = re ? $1.to_i : 0
  end
  #--------------------------------------------------------------------------
  # ● [追加]:簡易ヘルプ非表示の取得
  #--------------------------------------------------------------------------
  def no_display
    # キャッシュがある場合、それを返す
    return @no_display if @no_display
    # メモ取得
    re = LNX11::RE_USABLEITEM_NO_DISPLAY =~ note
    @no_display = re ? true : false
  end
  #--------------------------------------------------------------------------
  # ● [追加]:使用時追加ウェイトの取得
  #--------------------------------------------------------------------------
  def display_wait
    # キャッシュがある場合、それを返す
    return @display_wait if @display_wait
    # メモ取得
    re = LNX11::RE_DISPLAY_WAIT =~ note
    @display_wait = re ? $1.to_i : LNX11::HELPDISPLAT_WAIT
  end
  #--------------------------------------------------------------------------
  # ● [追加]:終了時追加ウェイトの取得
  #--------------------------------------------------------------------------
  def end_wait
    # キャッシュがある場合、それを返す
    return @end_wait if @end_wait
    # メモ取得
    re = LNX11::RE_END_WAIT =~ note
    @end_wait = re ? $1.to_i : LNX11::HELPDISPLAT_END_WAIT
  end
  #--------------------------------------------------------------------------
  # ● [追加]:簡易ヘルプ説明を取得
  #--------------------------------------------------------------------------
  def short_description
    # キャッシュがある場合、それを返す
    return @short_description if @short_description
    # メモ取得
    re = LNX11::RE_SHORT_DESCRIPTION =~ note
    @short_description = re ? $1 : ""
  end
end
